app/controllers/readings_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
---
  def index
    @readings = Reading.todays_readings.includes(:user)

INSERT INTO "readings" ("reading", "date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["reading", 0], ["date", "2022-03-11 18:30:00"], ["user_id", 1], ["created_at", "2022-03-12 07:41:58.311171"], ["updated_at", "2022-03-12 07:41:58.311171"]]
---
  def create
    reading = Reading.new(reading_params)
    if reading.save