app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "RK"], ["email", "rk@gmail.com"], ["phone", "8989889898"], ["created_at", "2022-03-12 07:41:21.204090"], ["updated_at", "2022-03-12 07:41:21.204090"]]
---
  def create
    user = User.new(user_params)
    if user.save