app/models/reading.rb

  def validate_per_user_per_day_reading
    self.date = Time.now.beginning_of_day
    readings = self.class.where(
      user_id: self.user_id,
      date: self.date
    ).count
---
SELECT COUNT(*) FROM "readings" WHERE "readings"."user_id" = ? AND "readings"."date" = ?  [["user_id", 1], ["date", "2022-03-11 18:30:00"]]