app/models/user.rb

SELECT MIN("readings"."reading") FROM "readings" WHERE "readings"."user_id" = ? AND (date >= '2022-02-28 18:30:00' and date <= '2022-03-30 18:30:00')  [["user_id", 1]]
SELECT MAX("readings"."reading") FROM "readings" WHERE "readings"."user_id" = ? AND (date >= '2022-02-28 18:30:00' and date <= '2022-03-30 18:30:00')  [["user_id", 1]]
SELECT AVG("readings"."reading") FROM "readings" WHERE "readings"."user_id" = ? AND (date >= '2022-02-28 18:30:00' and date <= '2022-03-30 18:30:00')  [["user_id", 1]]
---
  def get_report inputs
    report_type = inputs[:report_type] || 'daily'
    date = inputs[:date] || Time.now.to_s
    date =  Time.parse(date).beginning_of_day
    if ['daily', 'monthly', 'from_date'].include?(report_type)
      readings = send("#{report_type}_report".to_sym, date)
      min = readings.minimum(:reading)
      max = readings.maximum(:reading)
      avg = readings.average(:reading).to_f